Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/react-without-jsx_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: react-without-jsx title: React Without JSX permalink: docs/react-without-jsx.html ---
ja: --- id: react-without-jsx title: JSX なしで React を使う permalink: docs/react-without-jsx.html ---

source: JSX is not a requirement for using React.
ja: JSX は React を使うための必須事項ではありません。

source: Using React without JSX is especially convenient when you don't want to set up compilation in your build environment.
ja: JSX なしで React を使うことは、あなたのビルド環境で JSX のコンパイルの設定をしたくない時には便利です。

source: Each JSX element is just syntactic sugar for calling `React.createElement(component, props, ...children)`.
ja: 各 JSX 要素は、`React.createElement(component, props, ...children)` を呼び出すための単なるシンタックスシュガーです。

source: So, anything you can do with JSX can also be done with just plain JavaScript.
ja: つまり、JSX を使ってできることは、普通の JavaScript を使ってもできます。

source: For example, this code written with JSX:
ja: 例えば、JSX で書かれた以下のコードは：

source: can be compiled to this code that does not use JSX:
ja: JSX を使わない以下のコードにコンパイルできます：

source: If you're curious to see more examples of how JSX is converted to JavaScript, you can try out [the online Babel compiler](babel://jsx-simple-example).
ja: JSX から JavaScript への変換方法の例をもっと見たいなら、[オンラインの Babel コンパイラ](babel://jsx-simple-example)で試すことができます。

source: The component can either be provided as a string, as a subclass of `React.Component`, or a plain function.
ja: コンポーネントは文字列、`React.Component` のサブクラス、もしくはプレーンな関数のいずれかで指定されます。

source: If you get tired of typing `React.createElement` so much, one common pattern is to assign a shorthand:
ja: たくさんの `React.createElement` をタイピングするのにうんざりした場合、一般的なパターンの 1 つは以下のショートハンドを割り当てることです。

source: If you use this shorthand form for `React.createElement`, it can be almost as convenient to use React without JSX.
ja: このショートハンドを `React.createElement` に使用すれば、JSX なしで React を使うのにとても便利です。

source: Alternatively, you can refer to community projects such as [`react-hyperscript`](https://github.com/mlmorg/react-hyperscript) and [`hyperscript-helpers`](https://github.com/ohanhi/hyperscript-helpers) which offer a terser syntax.
ja: あるいは、簡潔な構文を提供する [`react-hyperscript`](https://github.com/mlmorg/react-hyperscript) や [`hyperscript-helpers`](https://github.com/ohanhi/hyperscript-helpers) のようなコミュニティプロジェクトも参照してみてください。
